# 1.교차분석
# 1-1. 교차분석의 개념
 # 범주형 자료(명목, 서열)인 두 변수 간의 관계를 알아보기 위한 분석 기법
 # 적합성 검정, 독립성 검정, 동질성 검정에 사용되며, 카이제곱 검정 통계량을 이용함



# 2. 적합성 검정
# 2-1. 적합성 검정 개념
 # 관측값들이 예상한 이론과 일치하는지 검정하는 방법
 # 관측값들이 어떠한 이론적 분포를 따르고 있는지 알아볼 수 있음. 즉 모집단 분포에 대한 가정이 옳게 되었는지를 관측값과 비교하여 검정하는 것

# 2-2. 가설 설정
 # 2-2-1. n개의 표본 자료를 k개의 범주로 분류한 뒤, 각 범주의 관측도수(O)와 주어진 확률 분포에 대해 각 범주에 속하는 기대도수(E)들이 적합하는지의 여부 검정
 # 2-2-2. 가설
  # 귀무가설: 실제 분포와 이론적 분포 간에는 차이가 없다.
  # 대립가설: 실제 분포와 이론적 분포 간에는 차이가 있다.

# 2-3. 함수: chisq.test(x, y, p)
 # x, y: 검정하고자 하는 데이터가 저장된 숫자 벡터 혹은 행렬 (x가 행렬인 경우 y는 무시됨)
 # p: 귀무가설을 통해 설정한 확률 값
data("survey", package="MASS")
str(survey)

# W.Hnd 변수의 분할표 확인
table(survey$W.Hnd)

# W.Hnd 변수의 분할표를 data 변수에 저장
data <- table(survey$W.Hnd)

# 적합성 검정
chisq.test(data, p=c(0.2,0.8))
# 귀무가설: 전체 응답자 중 왼손잡이의 비율이 20%, 오른손잡이의 비율이 80%이다.
# 대립가설: 전체 응답자 중 왼손잡이의 비율이 20%, 오른손잡이의 비율이 80%라고 할 수 없다.




# 3. 독립성 검정
# 3-1. 독립성 검정의 개념
 # 모집단이 두 변수 A, B에 의해 범주화되었ㅇ르 때, 두 변수들 간 관계가 독립인지 아닌지를 검정하는 것
 # 검정 통계량 값을 계산할 때는 교차표 활용

# 3-2. 가설 설정
 # 귀무가설: 두 변수 사이에는 연관이 없다.
 # 대립가설: 두 변수 사이에는 연관이 있다.

# 3-3. 함수
# 3-3-1. chisq.test함수 사용 / chisq.test()의 인자로는 두 변수에 대한 분할표 사용
 # 분할표 생성에는 xtabs(), table()함수 사용 가능
  # xtabs(formula, data) - formula를 사용해 분할표 생성
   # formula: 분할표를 만들고자 하는 변수를 'n~a1+a2+a3'와 같은 형태로 지정
   # n: 빈도를 나타내는 변수(없다면 생략 가능), a1~a3: 분할표에서 범주를 나타내는 변수
  # table(범주형변수): 도수분포표 생성
  # table(범주형변수1, 범주형변수2): 두 변수 간 이원분할표 생성

data(survey, package="MASS")

# 분할표 생성
table(survey$W.Hnd, survey$Exer)

# 카이제곱 검정을 통한 독립성 검정 수행
chisq.test(table(survey$W.Hnd, survey$Exer))





# 4. 동질성 검정
# 4-1. 동질성 검저으이 개념
 # 모집단이 임의의 변수에 따라 R개의 속성으로 범주화되었을 때, R개의 부분 모집단에서 추출한 각 표본인 C개의 범주화된 집단의 분포가 서로 동일한지를 검정하는 것
 # 검정 통계량 값을 계산할 때는 교차표를 활용하며, 계산법과 검증법은 모두 독립성 검정과 같은 방법으로 진행

# 4-2. 가설 설정
 # 귀무가설: 모든 Pnj는 동일하다(n=1, 2, ..., r)
 # 대립가설: Pnj 중 다른 값이 하나 이상 존재한다
