# 주성분 분석

# 1-1. 주성분 분석의 목적: 여러 변수들 간의 상관관계, 연관성을 이용해 소수의 주성분으로 차원을 축소함으로써 데이터를 이해하고 관리하기 쉽게 해줌
# 다중공선성이 존재하는 경우, 상관성이 없는(적은) 주성분으로 변수들을 축소하여 모형 개발에 활용 (회귀분석, 의사결정나무)
# 주성분 분석을 통해 변수 차원을 축소한 후 군집분석을 수행하면 군집화 결과와 연산속도 개선 가능
# 목표변수를 잘 예측/분류하기 위해 기존 변수들의 선형결합으로 이루어진 몇 개의 주성분을 찾아냄

# 1-2. R을 이용한 주성분 분석
# 1-2-1. prcomp(): 자료 행렬을 특이값 분해하는 방법 사용 / prcopm(데이터, center=TRUE, scale.=FALSE, ...)
                   # center: 값을 TRUE로 지정할 경우, 데이터의 중심이 0이 되게 함
                   # scale.: 값을 TRUE로 지정할 경우, 데이터를 표준화함
# 1-2-2. princomp(): 공분산행렬의 고유벡터를 구하는 방법 사용 / princomp(데이터, cor=FALSE, scores=TRUE, ...)
                     # cor=FALSE: 공분산행렬로 주성분분석 수행(변수의 측정단위 반영) / cor=TRUE: 상관행렬로 주성분분석 수행(변수의 측정단위 표준화)
                     # scores: 각 주성분의 점수를 계산해야 하는지의 여부를 나타내는 논리값


# 1. 데이터 확인 및 산점도를 통한 변수 간 상관관계 파악
library(datasets)
data("USArrests")                                  
head(USArrests)
pairs(USArrests, panel = panel.smooth, main = "USArrests data")
 # pairs(): 둘 이상의 변수에 대해 모든 가능한 산점도를 그려줌

# 2. 주성분분석 수행
 # USArrests 데이터는 변수들 간의 척도 차이가 상당히 크기 때문에 상관행렬 사용 (측정단위 표준화)
US.prin <- princomp(USArrests, cor = TRUE)
summary(US.prin)
plot(US.prin, type = "l")
 # 주성분분석의 결과를 plot 함수의 인자값으로 지정하면 scree plot 생성
 # 3번째 주성분에서 기울기가 급격하게 줄어드는 형태이므로, 그 이전의 2번째 주성분까지 선택하는 것이 적절

# 3. Loading: 주성분계수(변수들이 각 주성분에 기여하는 가중치) 제시
US.prin$loadings
 # ex) 제1주성분은 0.536*Murder + 0.583*Assault + 0.278*UrbanPop + 0.543*Rape의 선형결합식으로 이루어져 있음

# 4. scores: 주성분분석 결과, 차원축소로 얻어지는 주성분점수는 scores 인자를 통해 확인 가능
US.prin$scores

# 5. 제 1-2 주성분에 의한 행렬도
biplot(US.prin, scale = 0)
 # biplot(): 제1주성분과 제2주성분으로 이루어진 좌표평면상에 원 데이터 행들의 주성분점수를 산점도의 형태로 나타내고, 각 변수에 대한 주성분계수를 화살표로 시각화하여 그래프로 표현
 # 제1주성분의 모든 주성분계수는 양수이므로 가로축을 기준으로 모든 변수가 0 이상의 값을 가르키는 축을 나타냄
 # PC1을 이루는 선형 결합식에서 상대적 부하량의 절대값이 가장 큰 Assault 변수는 가장 수평의 형태를 나타냄
 # 상대적 부하량의 절대값이 가장 작은 UrbanPop 변수는 가장 수직에 가까운 형태를 나타냄







# 요인분석

# 1-1. 요인분석의 목적: 여러 변수들로 이루어진 데이터에서 변수들 간의 상관관계를 고려하여 서로 유사한 변수들을 묶어 새로운 잠재요인들을 추출해냄으로써 변수를 축소하고 데이터를 요약하는 데 사용
# 1-2. 요인분석을 수행하기 위해서는 변수가 간격 or 비율척도로 측정되어야 하며, 표본의 크기는 100개 이상이 바람직함(최소 50개 이상)
# 목표변수를 고려하지 않고 주어진 변수들ㅇ르 비슷한 성격으로 묶어서 새로운 (잠재)변수를 생성함
# 1-3. 요인분석의 용어
 # 요인: 상관계수가 높은 변수들을 묶어 새롭게 생성한 변수집단
 # 요인 적재값: 변수와 해당 요인간의 상관계수 / 요인 적재값으 ㅣ제곱: 해당 변수가 요인에 의해 설명되는 분산의 비율
 # 요인행렬: 요인들에 대한 모든 변수의 요인 적재값을 모은 행렬
 # 고유값: 각 요인에 대한 모든 변수들의 요인 적재값 제곱의 합 / 변수 속 정보(분산)가 어떤 요인에 의해 어느 정도 설명될 수 있는지를 나타내는 비율
 # 공통성: 여러 요인이 설명할 수 있는 한 변수의 분산의 양을 백분율로 나타낸 것 / 한 변수의 공통성은 추출된 요인들이 그 변수의 정보(분산)를 얼마만큼 설명할 수 있는지를 의미하며, 0과 1사이의 값을 가짐
# 1-4. 요인 추출 방법은 주로 주성분분석 이용
# 1-5. 요인의 수 결정
 # 고유값을 기준으로 할 때는, 고유값이 1 이상에 해당하는 요인들 추출
 # scree plot에서 요인의 설명력이 하락하다가 완만한 하락으로 추세가 바뀌기 직전 요인의 수를 기준으로 추출
 # 경우에 따라 추출할 요인의 수를 사전에 정의한 후 수행할 수도 있음
# 1-6. 요인분석의 절차
 # 데이터 입력 - 상관계수 산출 - 요인 추출(주성분분석으로 추출, 고유값/스크리도표 활용하여 요인 수 결정) - 요인 적재량 산출 - 요인회전(쿼티멕스, 베리맥스, 미쿼멕스, 오블리민) - 생성된 요인 해석 - 요인점수 산출


data("swiss")
str(swiss)

# 1. 정규화 수행 및 실습용 데이터 생성
Min <- apply(swiss, 2, min)
 # apply(데이터, 계산방향, 적용함수): 주어진 데이터의 행/열 방향으로 함수 적용
Max <- apply(swiss, 2, max)
swiss_fa <- scale(swiss, center = Min, scale = (Max-Min))
head(swiss_fa)

# 2. 요인분석 수행
factanal(swiss_fa, factors = 3)
 # factanal(데이터, factors=n, rotation="varimax", scores="regression", ...)
   # factors: 요인의 개수 지정
   # rotation: 요인 회전방법 (varimax, promax, none)
   # scores: 요인점수 계산방법 (regression, Bartlett)
 # factanal 함수 rotation 인자의 기본값은 "varimax"
